{"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TokenAndPositionEmbedding", "config": {"name": "token_and_position_embedding", "trainable": true, "dtype": "float32", "maxlen": 200, "vocab_size": 257, "embed_dim": 512}, "name": "token_and_position_embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TransformerBlock", "config": {"name": "transformer_block", "trainable": true, "dtype": "float32", "embed_dim": 512, "num_heads": 64, "ff_dim": 1024, "rate": 0.1}, "name": "transformer_block", "inbound_nodes": [[["token_and_position_embedding", 0, 0, {}]]]}, {"class_name": "TransformerBlock", "config": {"name": "transformer_block_1", "trainable": true, "dtype": "float32", "embed_dim": 512, "num_heads": 64, "ff_dim": 1024, "rate": 0.1}, "name": "transformer_block_1", "inbound_nodes": [[["transformer_block", 0, 0, {}]]]}, {"class_name": "TransformerBlock", "config": {"name": "transformer_block_2", "trainable": true, "dtype": "float32", "embed_dim": 512, "num_heads": 64, "ff_dim": 1024, "rate": 0.1}, "name": "transformer_block_2", "inbound_nodes": [[["transformer_block_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_6", "inbound_nodes": [[["transformer_block_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_18", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_7", "inbound_nodes": [[["dense_18", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 257, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "time_distributed", "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["time_distributed", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}